test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_SequenceBased_TestSolverLoop/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startTime       0;

endTime         2e-05;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      fixed;

timePrecision   6;

runTimeModifiable yes;

functions
{
    wallShearStress
    {
        type            wallShearStress;
        libs            ( "libfieldFunctionObjects.so" );
        patches         ( "mantle" );
        writePrecision  8;
        writeToFile     true;
        writeControl    timeStep;
        writeInterval   1;
        log             true;
    }
}


// ************************************************************************* //
