test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Parallel_SequenceBased_TestSolverLoop/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 ".*"
	 {
		 type            fixedValue;
	 	 value           uniform (0 0 0);
	 }


mantle
{
type fixedValue;
value  nonuniform List<vector>
1568
(
(0.0 0.0001545084971874737 -0.0)
(0.0 9.111776254014132e-05 0.0)
(0.0 8.936696028256877e-05 7.882768665809341e-06)
(0.0 0.00015153965973856468 -4.875226113666126e-06)
(0.0 8.418183585911935e-05 1.5462606952091728e-05)
(0.0 0.00014274723815068497 -9.56310002159034e-06)
(0.0 7.576165069669261e-05 2.2448225922668214e-05)
(0.0 0.0001284691202599644 -1.3883469357454812e-05)
...
);
}
